
* load external files

#+begin_src emacs-lisp :tangle yes
   (load "pi")
   (load "org-pdfview")
   (load "org-protocol-capture-html")
   (load "org-book")
   (load "org-depend")
   (load "bookmark+")
   (load "org-contacts")
   (load "org-toc")
   (load "org-registry")
   (load "run-assoc")
   (load "unbound")
   (load "org-checklist")
   (load "org-notify")
   (load "dired+")
         #+end_src

#+RESULTS:
: t

   
;(load "hangul")


* plain lists & bullets
#+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org-superstar)
   (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
   (setq org-superstar-headline-bullets-list '("◉" "❤""✼" "♢"    "⭆" ) )
;(setq org-superstar-item-bullet-alist (quote ((42 . 2023) (43 . 10148) (45 . 8226))))

   (setq org-list-demote-modify-bullet
         '(("+" . "*") ("-" . "+") ("*" . "-")))
                                           ;  (setq org-list-demote-modify-bullet
                                           ;       '(("+" . "-") ("-" . "+") ))
   (setq org-list-allow-alphabetical t)
   (setq org-list-indent-offset 1)
(setq org-superstar-prettify-item-bullets t)
   (setq org-list=description-max-indent 5)
                                           ;  (setq org-bullets-bullet-list (quote ( "⚫" "⧽" "○" "⯌"     "◆"  "☆"            "⚬" )))
                                           ;   "•"    "‣"    "⏵""▷"   "♦""◇"    "◉" "⬤"〇⭕ "⨀"  "★" "⬤" "ᐅ"  "〇"     "⟐"     "⚬" )))
                                           ;○◔◑◕●⌾⭗☉⌾◎◉⨀◎⌾◉◍⊗⊛•○∙∙⊛⁕✱ ൦❄⊕⊖⊗⊘⊙⊚⊛⊜⊝∘∙◉⏺○◍◎●◐◑◒◓◔◕◦◯◴◵◶◷☉⚪⚫⚬◐

                                           ; too tall: "⬥"  "⯈" "⚫" "∙" ⬤ ✶ "✧" "▸" "⯏"  "⭗"   "⛭" "⚪"  "⭐"  "⏵" 
   (setq org-inlinetask-min-level 7)
   (setq org-checkbox-hierarchical-statistics nil)

#+END_SRC

#+RESULTS:


* org-startup-defaults


#+BEGIN_SRC emacs-lisp :tangle yes
   (setq org-startup-indented t)
   (add-hook 'org-mode-hook (lambda () (org-indent-mode 1)))
   (add-hook 'org-mode-hook (lambda () (visual-line-mode 1)))
   (add-hook 'org-mode-hook (lambda () (auto-revert-mode 1)))
   (setq org-hide-emphasis-markers t)
   (setq org-hide-leading-stars t) 
   (setq org-startup-with-inline-images t)
   (setq org-startup-align-all-tables t)
   (setq org-startup-folded t)
   (setq org-special-ctrl-a/e (quote (t . t)))
                                           ;   (use-package org-bullets)
                                           ;  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
   (setq org-catch-invisible-edits (quote smart))
   (setq org-cycle-separator-lines 0)
   (setq org-support-shift-select t) 
   (setq org-show-context-detail '(
                                   (agenda . canonical)
                                   (bookmark-jump . canonical)
                                   (isearch . canonical)
                                   (default . minimal)

                                   ))


#+END_SRC

#+RESULTS:
: ((agenda . canonical) (bookmark-jump . canonical) (isearch . canonical) (default . minimal))

* org-mode
** org-agenda
*** org-agenda settings
#+begin_src emacs-lisp :tangle yes

      (setq org-agenda-window-setup 'current-window)

      (setq  org-agenda-sorting-strategy 
             '((agenda time-up)
               (todo priority-down category-keep)
               (tags priority-down category-keep)
               (search category-keep)))
      (setq org-agenda-tags-todo-honor-ignore-options t)
      (setq org-agenda-use-tag-inheritance t)

   (setq org-agenda-skip-deadline-if-done t)
      (setq org-agenda-skip-timestamp-if-done t)
      (setq org-agenda-skip-scheduled-if-done t)
      (setq org-agenda-current-time-string "✸✸✸✸✸")

      (setq org-agenda-start-with-clockreport-mode t)
      (setq org-agenda-span (quote day))
      (setq org-agenda-jump-prefer-future t)

      (setq org-agenda-with-colors t)
      (setq org-agenda-skip-deadline-prewarning-if-scheduled t)
      (setq org-agenda-start-on-weekday nil)


      (setq org-agenda-clockreport-parameter-plist
            (quote
             (:link t :maxlevel 2 :narrow 30 :tags t :tcolumns 1 :indent t :hidefiles t :fileskip0 t)))
      (setq org-agenda-dim-blocked-tasks 'invisible)
      (setq org-agenda-files
            (quote
             ("~/Dropbox/Zettelkasten/inbox.org" 
              "~/Dropbox/Zettelkasten/cal.org"
              "~/Dropbox/Zettelkasten/ndd.org"
              "~/Dropbox/Zettelkasten/readings.org"
              "~/Dropbox/Zettelkasten/habits.org"
              "~/Dropbox/Zettelkasten/journal.org"
              "~/Dropbox/Zettelkasten/lis.org"   
              "~/Dropbox/Zettelkasten/projects.org"
"~/Dropbox/Zettelkasten/contacts.org"
              )))
      (setq org-agenda-include-diary nil)
      (setq org-agenda-inhibit-startup nil)
      (setq org-agenda-time-grid
            (quote
             ((daily weekly today remove-match)
              (900  1200 1500  1800  2100 )
              "......" "----------------")))

      (defun kiwon/org-agenda-redo-in-other-window ()
        "Call org-agenda-redo function even in the non-agenda buffer."
        (interactive)
        (let ((agenda-window (get-buffer-window org-agenda-buffer-name t)))
          (when agenda-window
            (with-selected-window agenda-window (org-agenda-redo)))))
      (run-at-time nil 300 'kiwon/org-agenda-redo-in-other-window)


#+end_src                     

#+RESULTS:
: [nil 24443 23182 930186 300 kiwon/org-agenda-redo-in-other-window nil nil 280000]

*** org-agenda custom commands
:LOGBOOK:
CLOCK: [2020-07-06 Mon 10:55]--[2020-07-06 Mon 10:57] =>  0:02
:END:
(tags-todo "+STYLE=\"habit\"+SCHEDULED<=\"<today>\"+CATEGORY=\"mentat\"") 
(tags-todo "+STYLE=\"habit\"+SCHEDULED<=\"<today>\"+CATEGORY=\"HOME\"")
(tags-todo "+STYLE=\"habit\"+SCHEDULED<=\"<today>\"+CATEGORY=\"SYSADMIN\"")
        (setq org-stuck-projects '("/TODO|PROJ" ("NEXT|IN-PROG") ))
  ("j" "home todos" (
                                                         (tags-todo "cooking-Style=\"habit\"")
                                                         (tags-todo "cleaning-Style=\"habit\"")
                                                         (tags-todo "self-Style=\"habit\"")
                                                         ))

                                      ("n" "ndd & lis" (
                                                        (tags-todo "lis-/-HABIT-WAIT-HOLD")  
                                                        (tags-todo "editing-/-HABIT-WAIT-HOLD")      (tags-todo "ndd-admin-email-focus-/-HABIT-WAIT-HOLD")
                                                        (tags-todo "ndd+admin-/-HABIT-WAIT-HOLD")
                                                        (tags-todo "ndd+email-/-HABIT-WAIT-HOLD")
                                                        (tags-todo "ndd+focus-/-HABIT-WAIT-HOLD")

                                                        ))

                                      ("d" "mentat & sysadmin" (
                                                                (tags-todo "sysadmin-/-HABIT-WAIT-HOLD")
                                                                (tags-todo "mentat-/-HABIT-WAIT-HOLD")
                                                                ))

                                      ("p" "projects and areas" (
                                                                 (todo "PROJ")
                                                                 (todo "AREA")))

#+BEGIN_SRC emacs-lisp :tangle yes   
               (setq org-agenda-custom-commands '(

                                                  ("h" "Habits" tags-todo "STYLE=\"habit\""  ((org-agenda-overriding-header "Habits")))

                                                  ("b" "today's habits" ((agenda ""  ((org-agenda-span 1) )) (tags-todo "STYLE=\"habit\"+SCHEDULED<=\"<today>\""       ((org-agenda-files '("~/Dropbox/Zettelkasten/habits.org"))))))                                   

                                                  ("k" "all untagged TODOs" tags-todo "-{.*}")  ;RETURN ANY TODO ITEMS WTIHOUT TAGS

                                                  ("x" "With deadline columns" alltodo "" 
                                                   ((org-agenda-overriding-columns-format "%40ITEM %SCHEDULED %DEADLINE " )
                                                    (org-agenda-view-columns-initially t)
                                                    (org-agenda-sorting-strategy '(timestamp-up))
                                                    (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '("습관" "HOLD" "WAIT" "PROJ")) ) ))

                                                  ("l" "all todos"
                                                   ((agenda ""  ((org-agenda-span 1) ))
                                                    (alltodo "" ((org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled 'todo '("습관" "HOLD" "WAIT" "PROJ")) ))
                                                             (org-agenda-sorting-strategy '(priority-down)) )))

                                                  ("h" "all HOLD/WAIT items" todo "HOLD|WAIT")

                                                  ("g" "all UNSCHEDULED NEXT|TODAY|IN-PROG" ((agenda "" ((org-agenda-span 2)  (org-agenda-clockreport-mode nil)))
                                                                                             (todo "NEXT|TODAY|IN-PROG"))
                                                   ((org-agenda-todo-ignore-scheduled t)))

                                                  ("u" "all UNSCHEDULED" ((agenda "" ((org-agenda-span 4)
                                                                                      (org-agenda-clockreport-mode nil)))
                                                                          (tags-todo "ndd" ((org-agenda-overriding-header "NDD")))
                                                                          (tags-todo "lis" ((org-agenda-overriding-header "LIS")))
                                                                          (tags-todo "home" ((org-agenda-overriding-header "home")))
                                                                          (tags-todo "sysadmin" ((org-agenda-overriding-header "sysadmin")))
                                                                          (tags-todo "mentat" ((org-agenda-overriding-header "mentat")))
                                                           
                                                               
           )(    (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '("습관" "HOLD" "WAIT" "PROJ")) )
                (org-agenda-todo-ignore-scheduled t) )

                                                   )
            ))



                                                                         #+END_SRC

                                                                         #+RESULTS:
                                                                         | h | Habits                | tags-todo                                                                                                                                                                                                                                                                                                                                                      | STYLE="habit"                                                                                                              | ((org-agenda-overriding-header Habits))                                                                                                                                                                                                        |       |           |                                        |
                                                                         | b | today's habits        | ((agenda  ((org-agenda-span 1))) (tags-todo STYLE="habit"+SCHEDULED<="<today>" ((org-agenda-files '(~/Dropbox/Zettelkasten/habits.org)))))                                                                                                                                                                                                                     |                                                                                                                            |                                                                                                                                                                                                                                                |       |           |                                        |
                                                                         | k | all untagged TODOs    | tags-todo                                                                                                                                                                                                                                                                                                                                                      | -{.*}                                                                                                                      |                                                                                                                                                                                                                                                |       |           |                                        |
                                                                         | x | With deadline columns | alltodo                                                                                                                                                                                                                                                                                                                                                        |                                                                                                                            | ((org-agenda-overriding-columns-format %40ITEM %SCHEDULED %DEADLINE ) (org-agenda-view-columns-initially t) (org-agenda-sorting-strategy '(timestamp-up)) (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '(습관 HOLD WAIT PROJ)))) |       |           |                                        |
                                                                         | l | all todos             | ((agenda  ((org-agenda-span 1))) (alltodo  ((org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled 'todo '(습관 HOLD WAIT PROJ)))) (org-agenda-sorting-strategy '(priority-down))))                                                                                                                                                                   |                                                                                                                            |                                                                                                                                                                                                                                                |       |           |                                        |
                                                                         | h | all HOLD/WAIT items   | todo                                                                                                                                                                                                                                                                                                                                                           | HOLD                                                                                                                       | WAIT                                                                                                                                                                                                                                           |       |           |                                        |
                                                                         | g | all UNSCHEDULED NEXT  | TODAY                                                                                                                                                                                                                                                                                                                                                          | IN-PROG                                                                                                                    | ((agenda  ((org-agenda-span 2) (org-agenda-clockreport-mode nil))) (todo NEXT                                                                                                                                                                  | TODAY | IN-PROG)) | ((org-agenda-todo-ignore-scheduled t)) |
                                                                         | u | all UNSCHEDULED       | ((agenda  ((org-agenda-span 4) (org-agenda-clockreport-mode nil))) (tags-todo ndd ((org-agenda-overriding-header NDD))) (tags-todo lis ((org-agenda-overriding-header LIS))) (tags-todo home ((org-agenda-overriding-header home))) (tags-todo sysadmin ((org-agenda-overriding-header sysadmin))) (tags-todo mentat ((org-agenda-overriding-header mentat)))) | ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '(습관 HOLD WAIT PROJ))) (org-agenda-todo-ignore-scheduled t)) |                                                                                                                                                                                                                                                |       |           |                                        |

                                                                      
#+RESULTS:
| h | Habits                | tags-todo                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   | STYLE="habit" | ((org-agenda-overriding-header Habits))                                                                                                                                                                                                        |       |           |                                        |
| b | today's habits        | ((agenda  ((org-agenda-span 1))) (tags-todo STYLE="habit"+SCHEDULED<="<today>"))                                                                                                                                                                                                                                                                                                                                                                                                            |               |                                                                                                                                                                                                                                                |       |           |                                        |
| k | all untagged TODOs    | tags-todo                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   | -{.*}         |                                                                                                                                                                                                                                                |       |           |                                        |
| x | With deadline columns | alltodo                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |               | ((org-agenda-overriding-columns-format %40ITEM %SCHEDULED %DEADLINE ) (org-agenda-view-columns-initially t) (org-agenda-sorting-strategy '(timestamp-up)) (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '(습관 HOLD WAIT PROJ)))) |       |           |                                        |
| l | all todos             | ((agenda  ((org-agenda-span 1))) (alltodo  ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '(습관 HOLD WAIT PROJ)))) (org-agenda-sorting-strategy '(priority-down))))                                                                                                                                                                                                                                                                                                           |               |                                                                                                                                                                                                                                                |       |           |                                        |
| h | all HOLD/WAIT items   | todo                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        | HOLD          | WAIT                                                                                                                                                                                                                                           |       |           |                                        |
| g | all UNSCHEDULED NEXT  | TODAY                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       | IN-PROG       | ((agenda  ((org-agenda-span 2) (org-agenda-clockreport-mode nil))) (todo NEXT                                                                                                                                                                  | TODAY | IN-PROG)) | ((org-agenda-todo-ignore-scheduled t)) |
| u | all UNSCHEDULED       | ((agenda  ((org-agenda-span 4) (org-agenda-clockreport-mode nil))) (tags-todo ndd ((org-agenda-overriding-header NDD))) (tags-todo lis ((org-agenda-overriding-header LIS))) (tags-todo home ((org-agenda-overriding-header home))) (tags-todo sysadmin ((org-agenda-overriding-header sysadmin))) (tags-todo mentat ((org-agenda-overriding-header mentat))) (((org-agenda-todo-ignore-scheduled t))) (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '(습관 HOLD WAIT PROJ)))) |               |                                                                                                                                                                                                                                                |       |           |                                        |


("o" "todos by mode"(
(tags-todo "email-/-HABIT-HOLD-WAIT")
(tags-todo "intake-/-HABIT-WAIT-HOLD")
(tags-todo "focus-/-HABIT-WAIT-HOLD")
(tags-todo "admin-/-HABIT-WAIT-HOLD")
(tags-todo "discovery-/-HABIT-WAIT-HOLD")
(tags-todo "integrate-/-HABIT-WAIT-HOLD")
))

("e" "all todos/projects/etc." ((todo "IN-PROG")
(todo "NEXT")
(tags-todo "-watch-listen+/TODO")
(todo "PROJ")
(tags-todo "watch|listen")
)
)

("e" "all todos/projects/etc." tags-todo "-email-intake-admin-discovery-focus-integrate-cooking-cleaning-self-/-HABIT-WAIT-HOLD-PROJ-AREA")

("b" "Timeblocking" ((agenda "" 
((org-agenda-span 2)
(org-agenda-clockreport-mode nil)))
(todo "AREA")))


("i" "todos by area" (
(tags-todo "ndd")
(tags-todo "mentat-/-HOLD-WAIT")
(tags-todo "sysadmin-/-HOLD-WAIT")
(tags-todo "lis-/-HOLD-WAIT")
(tags-todo "home-/-HABIT-WAIT")
)
)



*** ORG-AGENDA HYDRA!
#+begin_src emacs-lisp :tangle yes
   ;; Hydra for org agenda (graciously taken from Spacemacs)
   (defhydra hydra-org-agenda (:pre (setq which-key-inhibit t)
                                    :post (setq which-key-inhibit nil)
                                    :hint none :color amaranth)
     "
   Org agenda (_q_uit)

   ^Clock^      ^Visit entry^              ^Date^             ^Other^
   ^-----^----  ^-----------^------------  ^----^-----------  ^-----^---------
   _ci_ in      _SPC_ in other window      _s_ schedule      _r_ reload
   _co_ out     _TAB_ & go to location     _dd_ set deadline  _._  go to today
   _cq_ cancel  _RET_ & del other windows  _dt_ timestamp     _gd_ go to date
   _cj_ jump    _o_   link                 _+_  do later      _n_ next line
   ^^           ^^                         _-_  do earlier    _p_ previous line
   ^^           ^^                         ^^                 ^^
   ^View^          ^Filter^                 ^Headline^         ^Toggle mode^
   ^----^--------  ^------^---------------  ^--------^-------  ^-----------^----
   _vd_ day        _ft_ by tag              _t_odo     _mf_ follow
   _vw_ week       _fr_ refine by tag                 _ml_ log
   _vt_ fortnight  _fc_ by category         _hr_ refile        _ma_ archive trees
   _vm_ month      _fh_ by top headline     _hA_ archive       _mA_ archive files
   _vy_ year       _fx_ by regexp           _,_ set tags      _mr_ clock report
   _vn_ next span  _fd_ delete all filters  _hp_ set priority  _md_ diaries
   _vp_ prev span  ^^                       ^^                 ^^
   _vr_ reset      ^^                       ^^                 ^^
   _n_ view ^^              ^^                       ^^                 ^^
   "
     ;; Entry
     ("hA" org-agenda-archive-default)
                                           ;  ("hk" org-agenda-kill)
     ("hp" org-agenda-priority)
     ("hr" org-agenda-refile)
     ("," org-agenda-set-tags)
     ("t" org-agenda-todo)
     ;; Visit entry
     ("o"   link-hint-open-link :exit t)
     ("<tab>" org-agenda-goto :exit t)
     ("TAB" org-agenda-goto :exit t)
     ("SPC" org-agenda-show-and-scroll-up)
     ("RET" org-agenda-switch-to :exit t)
     ;; Date
     ("dt" org-agenda-date-prompt :color red)
     ("dd" org-agenda-deadline)
     ("+" org-agenda-do-date-later)
     ("-" org-agenda-do-date-earlier)
     ("s" org-agenda-schedule :color red)
     ;; View
     ("<f7>" org-agenda)
     ("vd" org-agenda-day-view)
     ("vw" org-agenda-week-view)
     ("vt" org-agenda-fortnight-view)
     ("vm" org-agenda-month-view)
     ("vy" org-agenda-year-view)
     ("vn" org-agenda-later)
     ("vp" org-agenda-earlier)
     ("vr" org-agenda-reset-view)
     ;; Toggle mode
     ("ma" org-agenda-archives-mode)
     ("mA" (org-agenda-archives-mode 'files))
     ("mr" org-agenda-clockreport-mode)
     ("mf" org-agenda-follow-mode)
     ("ml" org-agenda-log-mode)
     ("md" org-agenda-toggle-diary)
     ;; Filter
     ("fc" org-agenda-filter-by-category)
     ("fx" org-agenda-filter-by-regexp)
     ("ft" org-agenda-filter-by-tag)
     ("fr" org-agenda-filter-by-tag-refine)
     ("fh" org-agenda-filter-by-top-headline)
     ("fd" org-agenda-filter-remove-all)
     ;; Clock
     ("cq" org-agenda-clock-cancel)
     ("cj" org-agenda-clock-goto :exit t)
     ("ci" org-agenda-clock-in :exit t)
     ("co" org-agenda-clock-out)
     ;; Other
     ("q" nil :exit t)
     ("gd" org-agenda-goto-date)
     ("n" next-line)
     ("p" previous-line)
     ("." org-agenda-goto-today)
     ("r" org-agenda-redo))

#+end_src

#+RESULTS:
: hydra-org-agenda/body

** org-habit
#+begin_src emacs-lisp :tangle yes
   (setq org-habit-graph-column 80)
   (setq org-habit-show-habits nil)
   (setq org-habit-show-all-today nil)
   (setq org-habit-show-habits-only-for-today nil)

   (defvar my/org-habit-show-graphs-everywhere t
     "If non-nil, show habit graphs in all types of agenda buffers.

      Normally, habits display consistency graphs only in
      \"agenda\"-type agenda buffers, not in other types of agenda
      buffers.  Set this variable to any non-nil variable to show
      consistency graphs in all Org mode agendas.")

   (defun my/org-agenda-mark-habits ()
     "Mark all habits in current agenda for graph display.

      This function enforces `my/org-habit-show-graphs-everywhere' by
      marking all habits in the current agenda as such.  When run just
      before `org-agenda-finalize' (such as by advice; unfortunately,
      `org-agenda-finalize-hook' is run too late), this has the effect
      of displaying consistency graphs for these habits.

      When `my/org-habit-show-graphs-everywhere' is nil, this function
      has no effect."
     (when (and my/org-habit-show-graphs-everywhere
                (not (get-text-property (point) 'org-series)))
       (let ((cursor (point))
             item data) 
         (while (setq cursor (next-single-property-change cursor 'org-marker))
           (setq item (get-text-property cursor 'org-marker))
           (when (and item (org-is-habit-p item)) 
             (with-current-buffer (marker-buffer item)
               (setq data (org-habit-parse-todo item))) 
             (put-text-property cursor
                                (next-single-property-change cursor 'org-marker)
                                'org-habit-p data))))))

   (advice-add #'org-agenda-finalize :before #'my/org-agenda-mark-habits)


#+end_src

#+RESULTS:

** org-list, bullets, checkboxes
*** checkboxes and todo states


#+BEGIN_SRC emacs-lisp :tangle yes
   (defun my/org-checkbox-todo ()
     "Switch header TODO state to DONE when all checkboxes are ticked, to TODO otherwise"
     (let ((todo-state (org-get-todo-state)) beg end)
       (unless (not todo-state)
         (save-excursion
           (org-back-to-heading t)
           (setq beg (point))
           (end-of-line)
           (setq end (point))
           (goto-char beg)
           (if (re-search-forward "\\[\\([0-9]*%\\)\\]\\|\\[\\([0-9]*\\)/\\([0-9]*\\)\\]"
                                  end t)
               (if (match-end 1)
                   (if (equal (match-string 1) "100%")
                       (unless (string-equal todo-state "DONE")
                         (org-todo 'done))
                     (unless (string-equal todo-state "✶")
                       (org-todo 'todo)))
                 (if (and (> (match-end 2) (match-beginning 2))
                          (equal (match-string 2) (match-string 3)))
                     (unless (string-equal todo-state "DONE")
                       (org-todo 'done))
                   (unless (string-equal todo-state "✶")
                     (org-todo 'todo)))))))))

   (add-hook 'org-checkbox-statistics-hook 'my/org-checkbox-todo)
#+END_SRC

#+RESULTS:
| my/org-checkbox-todo |
** org-clock
:PROPERTIES:
:UPDATE_DATE: 2020.0823
:END:
#+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org-clock-split)
   (setq org-log-into-drawer t)

   (setq org-clock-continuously nil)
   (setq org-log-note-clock-out t)
   (defun insert-timestamp (prefix)
     "Insert the current date. With prefix-argument, use ISO format. With
            two prefix arguments, write out the day and month name."
     (interactive "P")
     (let ((format (cond
                    ((not prefix) "%Y.%m%d")
                    ((Equal prefix '(4)) "%Y-%m-%d-%H%M")
                    ((equal prefix '(16)) "%A, %d. %B %Y")))
           )
       (insert (format-time-string format))))

   (setq org-mru-clock-how-many 80)
   (setq org-mru-clock-keep-formatting t)
   (defun my-org-clock-select-task ()
     (interactive)
     (org-clock-select-task))

   (define-key org-mode-map (kbd "C-<f2>") #'my-org-clock-select-task)



   (use-package org-clock-convenience
     :ensure t
     :bind (:map org-agenda-mode-map
                 ("<S-up>" . org-clock-convenience-timestamp-up)
                 ("<S-down>" . org-clock-convenience-timestamp-down)
                 ("e" . org-clock-convenience-fill-gap)
                 ("o" . org-clock-convenience-fill-gap-both)))





   (setq org-drawers (quote ("PROPERTIES" "LOGBOOK")))
   (setq org-clock-into-drawer t)
   (setq org-clock-out-remove-zero-time-clocks t)
                                           ;(setq org-clock-in-resume nil)

   (setq org-clock-out-when-done t)


   (setq org-clock-report-include-clocking-task t)


   (setq org-clock-mode-line-total (quote current))

   (setq org-clock-clocked-in-display (quote both))
   (setq org-clock-clocktable-default-properties
         (quote
          (:maxlevel 4 :block today :hidefiles t :tcolumns 1 :narrow 30 :level nil :link t)))
   (setq org-clock-history-length 15)


                                           ;      (setq org-clock-in-resume t)


   (setq org-clock-in-switch-to-state nil)
   (setq org-clock-persist 'history)
                                           ;      (org-clock-persistence-insinuate)
   (setq org-clock-persist-query-resume nil)
   (setq org-clock-sound t)
   (setq org-clocktable-defaults (quote (:maxlevel 4 :scope subtree)))


#+END_SRC

#+RESULTS:
| :maxlevel | 4 | :scope | subtree |

;removed trying to troubleshoot this helm timer error thing

(defun dfeich/helm-org-clock-in (marker)
"Clock into the item at MARKER"
(with-current-buffer (marker-buffer marker)
(goto-char (marker-position marker))
(org-clock-in)))
(eval-after-load 'helm-org
'(nconc helm-org-headings-actions
(list
(cons "Clock into task" #'dfeich/helm-org-clock-in))))



(setq helm-org-headings-actions '(
("Go to heading" . helm-org-goto-marker)
("Clock into task" . dfeich/helm-org-clock-in)
("Open in indirect buffer 'C-c i'" . helm-org--open-heading-in-indirect-buffer)
("Refile heading(s) (multiple-marked-to-selected, or current-to-selected) 'C-c w'" . helm-org--refile-heading-to)
("Insert link to this heading 'C-c l'" . helm-org-insert-link-to-heading-at-marker)
)
)

   









** org-refile and archiving
#+BEGIN_SRC emacs-lisp :tangle yes
   (setq org-refile-allow-creating-parent-nodes (quote confirm))
   (setq org-refile-use-outline-path (quote file))
   (setq org-archive-location
         "~/Dropbox/Zettelkasten/journal.org::datetree/")
   (setq org-archive-reversed-order nil)
   (setq org-refile-use-cache t)

   (defun my-org-refile-cache-clear ()
     (interactive)
     (org-refile-cache-clear))
   (define-key org-mode-map (kbd "C-0 C-c C-w") 'my-org-refile-cache-clear)


   (setq org-refile-targets (quote (("~/Dropbox/Zettelkasten/notes.org" :maxlevel . 2)
                                    ("~/Dropbox/Zettelkasten/projects.org" :maxlevel . 4)
                                    ("~/Dropbox/Zettelkasten/habits.org" :maxlevel . 2)
                                    ("~/Dropbox/Zettelkasten/ndd.org" :maxlevel . 1)
                                    ("~/Dropbox/Zettelkasten/bookmarks.org" :maxlevel . 1)
                                    ("~/Dropbox/Zettelkasten/inbox.org" :maxlevel . 2)
                                    ("~/Dropbox/Zettelkasten/personal.org" :maxlevel . 2)
                                           ;                                    ("~/Dropbox/Zettelkasten/someday.org" :maxlevel . 1)
                                    ("~/Dropbox/Zettelkasten/journal.org" :maxlevel . 3)
                                    ("~/Dropbox/Zettelkasten/cal.org" :maxlevel . 2)
                                    ("~/Dropbox/Zettelkasten/lis.org" :maxlevel . 2))))

   (setq org-outline-path-complete-in-steps nil) 

                                           ; Refile in a single go

                                           ;  (global-set-key (kbd "<f4>") 'org-refile)

   (setq org-refile-allow-creating-parent-nodes 'confirm)



#+END_SRC

#+RESULTS:
: confirm






#+RESULTS:
** org-chef
#+BEGIN_SRC emacs-lisp :tangle yes
   (use-package org-chef
     :defer t
     )
#+END_SRC

#+RESULTS:


** org-ref

#+BEGIN_SRC emacs-lisp :tangle yes

   (use-package org-ref
     :defer t)
   (setq reftex-default-bibliography '("~/Dropbox/Zettelkasten/references.bib"))

   ;; see org-ref for use of these variables
   (setq org-ref-bibliography-notes "~/Dropbox/Zettelkasten/readings.org"
         org-ref-default-bibliography '("~/Dropbox/Zettelkasten/references.bib")
         org-ref-pdf-directory "~/Dropbox/Library/")
   (setq org-ref-pdf-directory "~/Dropbox/Library")
   (setq bibtex-completion-bibliography "~/Dropbox/Zettelkasten/references.bib"

         bibtex-completion-notes-path "~/Dropbox/Zettelkasten/readings.org")
   (setq org-ref-prefer-bracket-links t)
   ;; open pdf with system pdf viewer (works on mac)
   (setq bibtex-completion-pdf-open-function
         (lambda (fpath)
           (start-process "open" "*open*" "open" fpath)))


                                           ;  (setq pdf-view-continuous nil)

                                           ;  (setq bibtex-autokey-year-title-separator "")
                                           ; (setq bibtex-autokey-titleword-length 0)


   (setq bibtex-completion-notes-template-one-file "\n* ${author} (${year}). /${title}/.\n:PROPERTIES:\n:Custom_ID: ${=key=}\n:CITATION: ${author} (${year}). /${title}/. /${journal}/, /${volume}/(${number}), ${pages}. ${publisher}. ${url}\n:READ_STATUS:\n:INGESTED:\n:FORMAT:\n:TYPE:\n:AREA:\n:END:")

   (setq bibtex-maintain-sorted-entries t)

   (use-package org-noter
     :ensure t
     :defer t
     :config (setq org-noter-property-doc-file "INTERLEAVE_PDF")
     (setq org-noter-property-note-location "INTERLEAVE_PAGE_NOTE") 
                                           ;       (setq org-noter-notes-window-location 'other-frame)
                                           ;      (setq org-noter-default-heading-title "p. $p$") 
     (setq org-noter-auto-save-last-location t))

   (use-package interleave 
     :defer t
     )
   (setq org-noter-always-create-frame nil)
   (setq org-noter-auto-save-last-location t)
   (setq org-noter-default-heading-title "$p$: ")
   (setq org-noter-default-notes-file-names (quote ("~/Dropbox/Zettelkasten/readings.org")))
   (setq org-noter-doc-split-fraction (quote (0.75 . 0.75)))
   (setq org-noter-insert-note-no-questions t)
   (setq org-noter-kill-frame-at-session-end nil)
   (setq org-noter-notes-search-path (quote ("~/Dropbox/Zettelkasten/")))
   (setq org-noter-notes-window-location (quote horizontal-split))


#+END_SRC

#+RESULTS:
: horizontal-split




	   

** org-capture
#+BEGIN_SRC emacs-lisp :tangle yes

   (server-start)
   (require 'org-protocol)
   (require 'org-protocol-capture-html)
   (setq org-protocol-default-template-key "w")

   (setq org-capture-templates
         '(
           ("a" "current activity" entry (file+olp+datetree "~/Dropbox/Zettelkasten/journal.org") "** %? \n" :clock-in t :clock-keep t :kill-buffer nil ) 

           ("c" "calendar" entry (file "~/Dropbox/Zettelkasten/cal.org") "* %^{EVENT}\n%^t\n%a\n%?")
           ("d" "download" table-line (id "reading") "|%^{Author} | %^{Title} | %^{Format}|"  )
           ("e" "emacs log" item (file+headline "~/Dropbox/Zettelkasten/personal.org" "Emacs config changes") "%U %a %?" :prepend t) 

           ("f" "Anki basic" entry (file+headline "~/Dropbox/Zettelkasten/anki.org" "Dispatch Shelf") "* %<%H:%M>   \n:PROPERTIES:\n:ANKI_NOTE_TYPE: Basic (and reversed card)\n:ANKI_DECK: Default\n:END:\n** Front\n%^{Front}\n** Back\n%^{Back}%?")

           ("F" "Anki cloze" entry (file+headline "~/Dropbox/Zettelkasten/anki.org" "Dispatch Shelf") "* %<%H:%M>   \n:PROPERTIES:\n:ANKI_NOTE_TYPE: Cloze\n:ANKI_DECK: Default\n:END:\n** Text\n%^{Front}%?\n** Extra")

           ("j" "journal" entry (file+olp+datetree "~/Dropbox/Zettelkasten/journal.org") "** journal :journal: \n%U  \n%?\n\n"   :clock-in t :clock-resume t :clock-keep nil :kill-buffer nil :append t) 
           ("l" "look up" entry (id "5br4n6815pi0") "* %? \n%U\n  \n%a\n\n\n" :prepend nil)
           ("m" "meditation" table-line (id "meditation") "|%u | %^{Time} | %^{Notes}|" :table-line-pos "II-1" )

           ("t" "todo" entry (file "~/Dropbox/Zettelkasten/inbox.org") "* TODO %? \n%a\n" :prepend nil)
           ("s" "to buy" item (id "shopping") "[ ] %?" :prepend t) 
           ("z" "zettel" entry (file "~/Dropbox/Zettelkasten/zettels.org") "* %^{TOPIC}\n%U\n %? \n%a\n\n\n" :prepend nil :unarrowed t)

           ("w" "org-protocol" entry (file "~/Dropbox/Zettelkasten/inbox.org")
            "* TODO %?%a\n%U\n%:initial\n" )


           ))


   (defun my-org-capture-place-template-dont-delete-windows (oldfun args)
     (cl-letf (((symbol-function 'delete-other-windows) 'ignore))
       (apply oldfun args)))

                                           ;this prevents org-capture from replacing any windows. it just adds. 

#+END_SRC

#+RESULTS:
: my-org-capture-place-template-dont-delete-windows

(with-eval-after-load "org-capture"
(advice-add 'org-capture-place-template :around 'my-org-capture-place-template-dont-delete-windows))

;  

;  ("n" "note" entry (file "~/Dropbox/Zettelkasten/inbox.org") "* %^{TOPIC}\n%U\n%? \n%a\n\n\n" :prepend nil)

; ("p" "pomodoro" table-line (id "6w81f6q04qi0") "| %^{Day & time} | %^{How many pomodoros?} | %^{Task} | %^{Area of focus|ndd|lis|home|sysadmin|} |%^{Mode}|  %^{Notes}|" :table-line-pos "I+1" )
("r" "reading log" table-line (id "em87rza1mni0") "|%^{Author}|%^{Title}|%^{Finished}|" :table-line-pos "I+1" )





** org navigation
#+BEGIN_SRC emacs-lisp :tangle yes
   (setq org-id-link-to-org-use-id (quote create-if-interactive))
   (setq org-id-method (quote org))
   (setq org-return-follows-link t)
   (setq org-goto-interface (quote outline-path-completion))
                                           ;   (add-hook 'org-mode-hook (lambda () (org-sticky-header-mode 1)))


   (setq global-visible-mark-mode t)

#+END_SRC

#+RESULTS:
| (lambda nil (org-sticky-header-mode)) | (lambda nil (org-sticky-header-mode 1)) | (closure (org--rds reftex-docstruct-symbol org-with-time org-defdecode org-def org-read-date-inactive org-ans2 org-ans1 org-columns-current-fmt-compiled org-end-time-was-given org-time-was-given org-blocked-by-checkboxes org-state org-agenda-headline-snapshot-before-repeat buffer-face-mode-face org-struct-menu org-last-state texmathp-why remember-data-file iswitchb-temp-buflist calc-embedded-open-mode calc-embedded-open-formula calc-embedded-close-formula align-mode-rules-list org-export-registered-backends ffap-url-regexp org-inlinetask-min-level t) nil (add-hook (quote change-major-mode-hook) (quote org-show-all) (quote append) (quote local))) | org-tempo-setup | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (lambda nil (org-superstar-mode 1)) | (lambda nil (auto-revert-mode 1)) | (lambda nil (visual-line-mode 1)) | (lambda nil (org-indent-mode 1)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load |

** org-misc
#+BEGIN_SRC emacs-lisp :tangle yes
   (setq org-modules
         (quote
          (ol-bibtex ol-eww org-habit org-id org-protocol ol-w3m ol-bookmark org-checklist org-depend org-registry)))
   (require 'cl) 
   (setq org-babel-load-languages '((emacs-lisp . t)
                                    (css . t)
                                    (latex . t)
                                    ))
   (setq org-edit-src-content-indentation 3)
                                           ;   If non-nil, the effect of TAB in a code block is as if it were issued in the language major mode buffer.
   (setq org-src-tab-acts-natively t)
   (add-to-list 'auto-mode-alist '("\\.txt$" . org-mode))
   (setq org-attach-id-dir "/home/betsy/Dropbox/Zettelkasten/attachments")
   (setq org-attach-method (quote ln))
   (setq org-attach-store-link-p t)
   (setq org-remove-highlights-with-change nil)
   (setq org-reverse-note-order t)
   (setq org-columns-default-format "%50ITEM %TODO %3PRIORITY %TAGS")
   (setq org-columns-default-format-for-agenda "%50ITEM %TODO %3PRIORITY %TAGS %CLOCKSUM")
   (setq org-ctrl-k-protect-subtree (quote error))
   (setq org-directory "~/Dropbox/Zettelkasten")
   (setq org-ellipsis " ⬎ ")
   (setq org-export-with-author nil)
   (setq org-export-with-toc nil)
   (setq org-export-initial-scope 'subtree)
   (setq org-export-with-section-numbers nil)

#+END_SRC

#+RESULTS:
** org-tags
#+BEGIN_SRC emacs-lisp :tangle yes

   (setq org-complete-tags-always-offer-all-agenda-tags nil)
   (setq org-tags-match-list-sublevels (quote indented))
   (setq tags-add-tables nil)
   (setq org-fast-tag-selection-single-key t)
   (setq org-use-fast-tag-selection (quote auto))

   (setq org-tag-persistent-alist '( 
                                    (:startgroup)
                                    ("ndd" . ?n)
                                    ("sysadmin" . ?s)
                                    ("home" . ?h)
                                    ("lis" . ?l)
                                    ("mentat" . ?m)
                                    ("editing" . ?e)
                                    (:endgroup)



                                    (:startgroup)
                                    ("admin" . ?a)
                                    ("focus" . ?f)
                                    (:endgroup)
                                    (:startgroup)
                                    ("email")
                                    ("discovery" . ?d)
                                    ("intake" . ?i)
                                    ("integrate")
                                    (:endgroup)

                                    (:startgrouptag)
                                    ("lis" . ?l)
                                    (:grouptags)

                                    ("csi")
                                    ("job")
                                    (:endgrouptag)

                                    (:startgrouptag)
                                    ("intake")
                                    (:grouptags)
                                    ("listen")
                                    ("read" . ?r)
                                    ("watch" . ?w)
                                    (:endgrouptag)

                                    (:startgrouptag)
                                    ("home" . ?h)
                                    (:grouptags)
				 ("habit")
                                    ("cooking")
                                    ("cleaning")
                                    (:endgrouptag)



                                    ))

   (setq org-tag-faces '(
                         ("ndd" :inherit org-tag :foreground "yellow green")
                         ("sysadmin" :inherit org-tag :foreground "yellow green")
                         ("lis" :inherit org-tag :foreground "yellow green")
                         ("mentat" :inherit org-tag :foreground "yellow green")
                         ("editing" :inherit org-tag :foreground "yellow green")
                         ("self" :inherit org-tag :foreground "yellow green")
                         ("home" :inherit org-tag :foreground "yellow green")
                                           ;group2
                         ("journal" :inherit org-tag :foreground "dark orange")
                         ("job" :inherit org-tag :foreground "dark orange")
                         ("csi" :inherit org-tag :foreground "dark orange")
                         ))


#+END_SRC

#+RESULTS:
| ndd      | :inherit | org-tag | :foreground | yellow green |
| sysadmin | :inherit | org-tag | :foreground | yellow green |
| lis      | :inherit | org-tag | :foreground | yellow green |
| mentat   | :inherit | org-tag | :foreground | yellow green |
| editing  | :inherit | org-tag | :foreground | yellow green |
| self     | :inherit | org-tag | :foreground | yellow green |
| home     | :inherit | org-tag | :foreground | yellow green |
| journal  | :inherit | org-tag | :foreground | dark orange  |
| job      | :inherit | org-tag | :foreground | dark orange  |
| csi      | :inherit | org-tag | :foreground | dark orange  |
("bcc" :inherit org-tag :foreground "yellow green")
("audiovisual" :inherit org-tag :foreground "dark orange")
   
("read" :inherit org-tag :foreground "dark orange")
("ingest" :inherit org-tag :foreground "dark orange")
("create" :inherit org-tag :foreground "dark orange")
("cleaning" :inherit org-tag :foreground "dark orange")
("admin" :inherit org-tag :foreground "dark orange")
("research" :inherit org-tag :foreground "dark orange")

(:startgrouptag)
("mentat" . ?m)
(:grouptags)
("korean")
(:endgrouptag)
    
#+TAGS: { MODE : admin(a) home(h) focus(f) lis(l) }
#+TAGS: { admin : email(e) browser(b) }
#+TAGS: { focus : read(r) notes(n) }
#+TAGS: { home : kitchen(k) laundry cleaning }
("bcc")
(:startgrouptag)
("sysadmin" . ?s)
(:grouptags)
("emacs")
("system")
(:endgrouptag)

** org-todo
#+BEGIN_SRC emacs-lisp :tangle yes
   (setq org-todo-keywords
         (quote
          ((sequence "TODO(t)" "NEXT(n)" "IN-PROG(i)" "TODAY(o)" "WAIT(w)" "|" "DONE(d)" )
           (type "AREA(a)" "PROJ(p)"  "습관(h)"   "HOLD(l)"  "|" "DONE(d)")
           (sequence "|" "x(c)")



           )))
   (setq org-edna-mode t)
   (org-edna-mode)
   (setq org-log-done (quote time))
   (setq org-enforce-todo-checkbox-dependencies nil)
   (setq org-enforce-todo-dependencies t)
#+END_SRC

#+RESULTS:
: t

* accessibility
#+begin_src emacs-lisp :tangle yes
   (defhydra hydra-zoom (:color red)  "zoom"
     ("=" text-scale-increase "in")
     ("-" text-scale-decrease "out")
     ("0" (text-scale-adjust 0) "reset")
     ("o" (other-window) "other window")
     ("q" nil "quit" :color blue))

   (global-set-key (kbd "C-=") 'hydra-zoom/body)

#+end_src

#+RESULTS:
: hydra-zoom/body







* navigating
** DEFT 
#+begin_src emacs-lisp :tangle yes
   (use-package deft
     :ensure t)
   (setq deft-directory "~/Dropbox/Zettelkasten/")
   (setq deft-default-extension "org")
   (setq deft-time-format " %b-%Y %H:%M")
   (setq deft-use-filename-as-title t)
   (setq deft-new-file-format "%Y%b%d")
   (setq deft-text-mode 'org-mode)
   (setq deft-file-naming-rules '((noslash . "-")
                                  (nospace . "-")
                                  (case-fn . downcase))) 
   (setq deft-recursive t)
   (setq deft-extensions '("org" "txt" "emacs" "bib" "ledger" "el" "tex"))
   (setq deft-auto-save-interval 1.0)
   (add-hook 'after-init-hook 'deft)
   (add-hook 'deft-mode-hook #'visual-line-mode)


#+end_src

#+RESULTS:
| visual-line-mode |

** HELM
#+begin_src emacs-lisp :tangle yes
   (use-package helm
     :ensure t
     :config (helm-mode 1))
   (setq history-delete-duplicates t)
   (setq helm-M-x-always-save-history t)
   (setq helm-M-x-reverse-history nil)
   (setq helm-bibtex-full-frame nil)
   (setq helm-display-buffer-default-height 22)
   (setq helm-full-frame nil)
   (setq helm-help-full-frame nil)
   (setq helm-move-to-line-cycle-in-source nil)
   (setq helm-org-rifle-show-path nil)
                                           ;(setq helm-split-window-inside-p nil)

#+end_src

#+RESULTS:


#+BEGIN_SRC emacs-lisp :tangle yes
   (setq bookmark-save-flag 1)
   (use-package ido
     :ensure t
     :defer t
     )
   (ido-mode t)

   (setq ido-file-extensions-order '(".org" ".txt" ".emacs" ".el" ".ini" ".cfg" ".cnf"))

   (use-package projectile
     :ensure t
     )
   (use-package helm-projectile
     :ensure t
     )

   (projectile-mode +1)
   (setq zoom-mode t)

   (defun size-callback ()
     (cond ((> (frame-pixel-width) 1280) '(90 . 0.75))
           (t                            '(0.5 . 0.5))))

   (custom-set-variables
    '(zoom-size 'size-callback))

   (custom-set-variables
    '(zoom-ignored-major-modes '(dired-mode markdown-mode))
    '(zoom-ignored-buffer-names '("zoom.el" "init.el"))
    '(zoom-ignored-buffer-name-regexps '("^*calc"))
    '(zoom-ignore-predicates '((lambda () (> (count-lines (point-min) (point-max)) 20)))))

   (custom-set-variables
    '(temp-buffer-resize-mode t))

                                           ;If you want to mark a folder manually as a project just create an empty .projectile file in it.
#+END_SRC

#+RESULTS:
** windows

*** window functions
#+BEGIN_SRC emacs-lisp :tangle yes
                                           ;   (eyebrowse-mode t)
                                           ;undo and redo changes in window configuration eg go to previous buffer 
   (winner-mode 1)

   (defun transpose-windows ()
     (interactive)
     (let ((this-buffer (window-buffer (selected-window)))
           (other-buffer (prog2
                             (other-window +1)
                             (window-buffer (selected-window))
                           (other-window -1))))
       (switch-to-buffer other-buffer)
       (switch-to-buffer-other-window this-buffer)
       (other-window -1)))



   (setq frame-title-format (list (format "%s %%S: %%j " (system-name))
                                  '(buffer-file-name "%f" (dired-directory dired-directory "%b"))
                                  ))

   (defun window-split-toggle ()
     "Toggle between horizontal and vertical split with two windows."
     (interactive)
     (if (> (length (window-list)) 2)
         (error "Can't toggle with more than 2 windows!")
       (let ((func (if (window-full-height-p)
                       #'split-window-vertically
                     #'split-window-horizontally)))
         (delete-other-windows)
         (funcall func)
         (save-selected-window
           (other-window 1)
           (switch-to-buffer (other-buffer))))))

#+END_SRC

#+RESULTS:
: window-split-toggle

*** window HYDRA
#+begin_src emacs-lisp :tangle yes


   (defhydra hydra-window ()
     "
      Movement^^        ^Split^         ^Switch^		^Resize^
      ----------------------------------------------------------------
      _h_ ←       	_v_ertical    	_b_uffer		_q_ shrink
      _j_ ↓        	_x_ horizontal	_f_ind files	_w_ balance
      _k_ ↑        	_z_ undo      	_a_ce 1		_e_nlarge
      _l_ →        	_Z_ reset      	_s_wap		_r_ split toggle
      _F_ollow		_D_lt Other   	_S_ave		max_i_mize
      _SPC_ cancel	_o_nly this   	_d_elete          _t_ranspose	
      "
     ("h" windmove-left )
     ("j" windmove-down )
     ("k" windmove-up )
     ("l" windmove-right )
     ("q" shrink-window-horizontally)
     ("w" balance-windows)
     ("e" enlarge-window)
     ("r" window-split-toggle)
     ("b" helm-mini)
     ("f" helm-find-files)
     ("F" follow-mode)
     ("a" (lambda ()
            (interactive)
            (ace-window 1)
            (add-hook 'ace-window-end-once-hook
                      'hydra-window/body))
      )
     ("v" (lambda ()
            (interactive)
            (split-window-right)
            (windmove-right))
      )
     ("x" (lambda ()
            (interactive)
            (split-window-below)
            (windmove-down))
      )
     ("s" (lambda ()
            (interactive)
            (ace-window 4)
            (add-hook 'ace-window-end-once-hook
                      'hydra-window/body)))
     ("S" save-buffer)
     ("d" delete-window)
     ("D" (lambda ()
            (interactive)
            (ace-window 16)
            (add-hook 'ace-window-end-once-hook
                      'hydra-window/body))
      )
     ("o" delete-other-windows)
     ("i" ace-maximize-window)
     ("t" transpose-windows)
     ("z" (progn
            (winner-undo)
            (setq this-command 'winner-undo))
      )
     ("Z" winner-redo)
     ("SPC" nil)
     )
   (global-set-key (kbd "C-<f9>") 'hydra-window/body)

#+end_src

#+RESULTS:
: hydra-window/body

** between buffers
#+begin_src emacs-lisp :tangle yes

   (defhydra hydra-buffer-menu (:color pink
                                       :hint nil)
     "
   ^Mark^             ^Unmark^           ^Actions^          ^Search
   ^^^^^^^^-----------------------------------------------------------------
   _m_: mark          _u_: unmark        _x_: execute       _R_: re-isearch
   _s_: save          _U_: unmark up     _b_: bury          _I_: isearch
   _d_: delete        ^ ^                _g_: refresh       _O_: multi-occur
   _D_: delete up     ^ ^                _T_: files only: % -28`Buffer-menu-files-only
   _~_: modified
   "
     ("m" Buffer-menu-mark)
     ("u" Buffer-menu-unmark)
     ("U" Buffer-menu-backup-unmark)
     ("d" Buffer-menu-delete)
     ("D" Buffer-menu-delete-backwards)
     ("s" Buffer-menu-save)
     ("~" Buffer-menu-not-modified)
     ("x" Buffer-menu-execute)
     ("b" Buffer-menu-bury)
     ("g" revert-buffer)
     ("T" Buffer-menu-toggle-files-only)
     ("O" Buffer-menu-multi-occur :color blue)
     ("I" Buffer-menu-isearch-buffers :color blue)
     ("R" Buffer-menu-isearch-buffers-regexp :color blue)
     ("c" nil "cancel")
     ("v" Buffer-menu-select "select" :color blue)
     ("o" Buffer-menu-other-window "other-window" :color blue)
     ("q" quit-window "quit" :color blue))

   (define-key Buffer-menu-mode-map "." 'hydra-buffer-menu/body)


#+end_src

#+RESULTS:
: hydra-buffer-menu/body

** in buffers
#+begin_src emacs-lisp :tangle yes
   (eval-after-load "helm"
     '(define-key helm-map (kbd "C-'") 'ace-jump-helm-line))

#+end_src

#+RESULTS:
: ace-jump-helm-line

* debugging
#+BEGIN_SRC emacs-lisp :tangle yes
   (setq debug-on-error nil)

   (defun test-emacs ()
     "Test if emacs starts correctly."
     (interactive)
     (if (eq last-command this-command)
         (save-buffers-kill-terminal)
       (require 'async)
       (async-start
        (lambda () (shell-command-to-string
                    "emacs --batch --eval \"
   (condition-case e
       (progn
         (load \\\"~/.emacs.d/init.el\\\")
         (message \\\"-OK-\\\"))
     (error
      (message \\\"ERROR!\\\")
      (signal (car e) (cdr e))))\""))
        `(lambda (output)
           (if (string-match "-OK-" output)
               (when ,(called-interactively-p 'any)
                 (message "All is well"))
             (switch-to-buffer-other-window "*startup error*")
             (delete-region (point-min) (point-max))
             (insert output)
             (search-backward "ERROR!"))))))



#+END_SRC

#+RESULTS:
: test-emacs
https://emacs.stackexchange.com/questions/28429/how-do-i-troubleshoot-emacs-problems

(require 'package)
(setq package-load-list
'(	(helm t)
(ace-jump-buffer t)
(avy t)
(dash t)
(async t)
(popup t)
(helm-core t)
(ace-jump-mode t)
(ace-link t)
(ace-window t)
(activity-watch t)
(use-package t)
(bind-key t)
(aggressive-indent t)
(all-the-icons t)
(memoize t)
(anki-connect t)
(anki-editor t)
(request t)
(auto-complete-auctex t)
(yasnippet t)
(auto-complete t)
(calfw t)
(calfw-org t)
(centered-cursor-mode t)
(clean-buffers      t)
(company-auctex     t)
(company-bibtex     t)

(crux               t)
(define-word        t)
(deft t)
(diminish t)          
(dired-toggle-sudo  t)
(doom-themes        t)
(ebib               t)
(expand-region      t)
(flyspell-correct-helm t)
(gnu-elpa-keyring-update t)
(dash-functional t)
(company t)
(auctex t)
(parsebib t)
(flyspell-correct t)

(gnuplot            t)
(gnuplot-mode       t)
(helm-bibtexkey     t)
(chronos t)
(helm-chronos       t)
(helm-flyspell      t)
(helm-org           t)

(helm-swoop         t)
(helm-unicode       t)
(highlight          t)
(hl-anything        t)
(html2org           t)
(interleave         t)
(keychain-environment t)
(korean-holidays    t)
(latex-preview-pane t)
(ledger-mode        t)
(magit              t)
(magit-popup        t)
(markdown-mode      t) 
(markdown-preview-eww t)
(mixed-pitch        t)
(most-used-words    t)
(mu4e-conversation  t)
(multiple-cursors   t)
(mw-thesaurus       t)
(nov                t)
(olivetti           t)
(on-screen          t)
(openwith           t)
(org                t)
(org-ac             t)
(org-alert          t)
(org-bookmark-helm t)
(org-chef           t)
(org-cliplink       t)
(org-clock-convenience t)
(git-commit t)
(transient t)
(with-editor t)
(esxml t)
(auto-complete-pcmp t)
(log4e t)
(yaxception t)
(s t)
(alert t)
(gntp t)
(org-clock-split    t)
(org-clock-today    t)
(org-download       t)
(org-edna           t)
(org-mru-clock      t)
(org-msg            t)
(org-noter          t)



(org-plus-contrib   t)
(org-pomodoro       t)
(org-recent-headings t)

(org-roam           t)
(org-sticky-header  t)
(org-superstar      t)
(org-treeusage      t)
(org-web-tools      t)
(htmlize t)
(frecency t)
(a t)
(helm-bibtex t)
(bibtex-completion t)
(f t)
(biblio t)
(biblio-core t)
(ivy t)
(hydra t)
(lv t)
(key-chord t)
(emacsql t)
(emacsql-sqlite3 t)

(ov                 t)
(ox-clip            t)
(ox-pandoc          t)
(pandoc             t)
(pandoc-mode        t)
(pdf-view-restore   t)
(powerthesaurus     t)
(quelpa             t)
(rainbow-delimiters t)
(scrollkeeper       t)
(smartparens        t)
(solarized-theme    t)
(speed-type         t)
(spray              t)
(ssh-agency         t)
(undo-tree          t)

(unkillable-scratch t)
(uptimes            t)
(visible-mark       t)
(visual-fill-column t)
(w3m                t)
(which-key          t)
(xml+               t)
(yankpad            t)
(zoom               t)
(ht t)
(pdf-tools t)
(tablist t)
(jeison t)
(swiper t)
(counsel            t)
(helm-org-rifle     t)



(org-noter-pdftools t)
(org-pdftools       t)
(org-pdfview        t)
(org-ref            t)
(bufler t)
(pretty-hydra t)
(magit-section t)
(company-org-roam t)
(projectile t)
(pkg-info t)
(epl t)
(helm-projectile    t)
(persistent-soft t)
(pcache t)
(list-utils t)
(font-utils t)
(unicode-fonts      t)
(ucs-utils t)
(powerthesaurus t)
(with-editor t)
))
(package-initialize)

* web

#+BEGIN_SRC emacs-lisp :tangle yes
   (setq browse-url-browser-function 'browse-url-generic
         browse-url-generic-program "brave-browser")

   (defun my-set-eww-buffer-title ()
     (let* ((title (plist-get eww-data :title))
            (url   (plist-get eww-data :url))
            (result (concat "*eww-" 
                            (or title Norton Guide reader     
                                (if (string-match "://" url)
                                    (substring url (match-beginning 0))
                                  url)) "*")))
       (rename-buffer result t)))

   (add-hook 'eww-after-render-hook 'my-set-eww-buffer-title)
   (add-hook 'eww-after-render-hook 'visual-fill-column-mode)
   (add-hook 'eww-after-render-hook 'visual-line-mode)


   (eval-after-load 'shr  
     '(progn (setq shr-width -1)  
             (defun shr-fill-text (text) text)  
             (defun shr-fill-lines (start end) nil)  
             (defun shr-fill-line () nil)))

   (setq browse-url-browser-function (quote browse-url-firefox))
   (setq browse-url-firefox-new-window-is-tab t)


#+END_SRC

#+RESULTS:
: t



* buffer file encoding
C-h C RET
M-x describe-current-coding-system

#+BEGIN_SRC  emacs-lisp :tangle yes
   (set-language-environment "UTF-8")
   (set-default-coding-systems 'utf-8)

   (setq inhibit-eol-conversion nil)

   (add-to-list 'file-coding-system-alist '("\\.tex" . utf-8-unix) )
   (add-to-list 'file-coding-system-alist '("\\.txt" . utf-8-unix) )
   (add-to-list 'file-coding-system-alist '("\\.el" . utf-8-unix) )
   (add-to-list 'file-coding-system-alist '("\\.scratch" . utf-8-unix) )
   (add-to-list 'file-coding-system-alist '("user_prefs" . utf-8-unix) )

   (add-to-list 'process-coding-system-alist '("\\.txt" . utf-8-unix) )

   (add-to-list 'network-coding-system-alist '("\\.txt" . utf-8-unix) )

   (prefer-coding-system 'utf-8-unix)
   (set-default-coding-systems 'utf-8-unix)
   (set-terminal-coding-system 'utf-8-unix)
   (set-keyboard-coding-system 'utf-8-unix)
   (set-selection-coding-system 'utf-8-unix)
   (setq-default buffer-file-coding-system 'utf-8-unix)

   ;; Treat clipboard input as UTF-8 string first; compound text next, etc.
   (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

   ;; mnemonic for utf-8 is "U", which is defined in the mule.el
   (setq eol-mnemonic-dos ":CRLF")
   (setq eol-mnemonic-mac ":CR")
   (setq eol-mnemonic-undecided ":?")
   (setq eol-mnemonic-unix ":LF")

   (defalias 'read-buffer-file-coding-system 'lawlist-read-buffer-file-coding-system)
   (defun lawlist-read-buffer-file-coding-system ()
     (let* ((bcss (find-coding-systems-region (point-min) (point-max)))
            (css-table
             (unless (equal bcss '(undecided))
               (append '("dos" "unix" "mac")
                       (delq nil (mapcar (lambda (cs)
                                           (if (memq (coding-system-base cs) bcss)
                                               (symbol-name cs)))
                                         coding-system-list)))))
            (combined-table
             (if css-table
                 (completion-table-in-turn css-table coding-system-alist)
               coding-system-alist))
            (auto-cs
             (unless find-file-literally
               (save-excursion
                 (save-restriction
                   (widen)
                   (goto-char (point-min))
                   (funcall set-auto-coding-function
                            (or buffer-file-name "") (buffer-size))))))
            (preferred 'utf-8-unix)
            (default 'utf-8-unix)
            (completion-ignore-case t)
            (completion-pcm--delim-wild-regex ; Let "u8" complete to "utf-8".
             (concat completion-pcm--delim-wild-regex
                     "\\|\\([[:alpha:]]\\)[[:digit:]]"))
            (cs (completing-read
                 (format "Coding system for saving file (default %s): " default)
                 combined-table
                 nil t nil 'coding-system-history
                 (if default (symbol-name default)))))
       (unless (zerop (length cs)) (intern cs))))

#+END_SRC

#+RESULTS:
: lawlist-read-buffer-file-coding-syste

* Autosave-backup-git

#+BEGIN_SRC emacs-lisp :tangle yes

   (use-package magit
     :ensure t
     :init (progn
             (setq magit-repository-directories '("~/Dropbox/" ))))

   (setq auto-save-default t)
   (setq auto-save-visited-file-name t)
   (setq auto-save-visited-mode t)
   (setq dired-auto-revert-buffer (quote dired-directory-changed-p))
   (setq auto-save-interval 10)
   (setq auto-save-timeout 5)
   (setq global-auto-revert-mode t)

#+END_SRC

#+RESULTS:
: t

* pdf-tools


#+BEGIN_SRC emacs-lisp :tangle yes
   (pdf-tools-install)

   (add-hook 'pdf-view-mode-hook 'pdf-view-restore-mode)

   (use-package pdf-tools :defer t)
   (use-package org-pdfview :defer t)
                                           ;     (add-hook 'pdf-view-mode-hook (lambda () (visual-fill-column-mode 0)))

   (add-to-list 'org-file-apps '("\\.pdf\\'" . org-pdfview-open))
   (add-to-list 'org-file-apps '("\\.pdf::\\([[:digit:]]+\\)\\'" .  org-pdfview-open))

   (setq pdf-view-continuous nil)
   (add-to-list 'org-file-apps 
                '("\\.pdf\\'" . (lambda (file link)
                                  (org-pdfview-open link))))


   (defhydra hydra-pdftools (:color blue :hint nil)
     "
                                                                         ╭───────────┐
          Move  History   Scale/Fit     Annotations  Search/Link    Do   │ PDF Tools │
      ╭──────────────────────────────────────────────────────────────────┴───────────╯
            ^^_g_^^      _B_    ^↧^    _+_    ^ ^     [_al_] list    [_s_] search    [_u_] revert buffer
            ^^^↑^^^      ^↑^    _H_    ^↑^  ↦ _W_ ↤   [_am_] markup  [_o_] outline   [_i_] info
            ^^_p_^^      ^ ^    ^↥^    _0_    ^ ^     [_at_] text    [_F_] link      [_d_] dark mode
            ^^^↑^^^      ^↓^  ╭─^─^─┐  ^↓^  ╭─^ ^─┐   [_ad_] delete  [_f_] search link
       _h_ ←pag_e_→ _l_  _N_  │ _P_ │  _-_    _b_     [_aa_] dired
            ^^^↓^^^      ^ ^  ╰─^─^─╯  ^ ^  ╰─^ ^─╯   [_y_]  yank
            ^^_n_^^      ^ ^  _r_eset slice box
            ^^^↓^^^
            ^^_G_^^
      --------------------------------------------------------------------------------
           "
     ("\\" hydra-master/body "back")
     ("<ESC>" nil "quit")
     ("al" pdf-annot-list-annotations)
     ("ad" pdf-annot-delete)
     ("aa" pdf-annot-attachment-dired)
     ("am" pdf-annot-add-markup-annotation)
     ("at" pdf-annot-add-text-annotation)
     ("y"  pdf-view-kill-ring-save)
     ("+" pdf-view-enlarge :color red)
     ("-" pdf-view-shrink :color red)
     ("0" pdf-view-scale-reset)
     ("H" pdf-view-fit-height-to-window)
     ("W" pdf-view-fit-width-to-window)
     ("P" pdf-view-fit-page-to-window)
     ("n" pdf-view-next-page-command :color red)
     ("p" pdf-view-previous-page-command :color red)
     ("d" pdf-view-dark-minor-mode)
     ("b" pdf-view-set-slice-from-bounding-box)
     ("r" pdf-view-reset-slice)
     ("g" pdf-view-first-page)
     ("G" pdf-view-last-page)
     ("e" pdf-view-goto-page)
     ("o" pdf-outline)
     ("s" pdf-occur)
     ("i" pdf-misc-display-metadata)
     ("u" pdf-view-revert-buffer)
     ("F" pdf-links-action-perfom)
     ("f" pdf-links-isearch-link)
     ("B" pdf-history-backward :color red)
     ("N" pdf-history-forward :color red)
     ("l" image-forward-hscroll :color red)
     ("h" image-backward-hscroll :color red))

#+END_SRC

#+RESULTS:
: hydra-pdftools/body









* latex
#+BEGIN_SRC emacs-lisp :tangle yes
   (use-package company-auctex)
   (company-auctex-init)


   (use-package tex :ensure auctex)

   (setq TeX-auto-save t)
   (setq TeX-parse-self t)


#+END_SRC

#+RESULTS:
: t

* yasnippet & yankpad

#+BEGIN_SRC emacs-lisp :tangle yes

   (use-package yasnippet                  ; Snippets
     )



   (use-package yankpad
     :ensure t
     :defer 10
     :init
     (setq yankpad-file "~/Dropbox/Zettelkasten/yankpad.org")


     )

   (setq yankpad-respect-current-org-level t)
   (setq yas-global-mode t)
   (setq yas-snippet-dirs
         (quote
          ("/home/betsy/Dropbox/emacs/.emacs.d/snippets")))


   (defhydra hydra-yasnippet (:color red :hint nil)
     "
                    ^YASnippets^
      --------------------------------------------
        Modes:    Load/Visit:    Actions:

       _g_lobal  _d_irectory    _i_nsert
       _m_inor   _f_ile         _t_ryout
       _e_xtra   _l_ist         _n_ew
                reload _a_ll
      "
     ("n" down "done")
     ("p" down "up")
     ("N" outline-next-visible-heading "next heading")
     ("P" outline-previous-visible-heading "prev heading")
     ("d" yas-load-directory)
     ("e" yas-activate-extra-mode)
     ("i" yas-insert-snippet)
     ("f" yas-visit-snippet-file :color blue)
     ("n" yas-new-snippet)
     ("t" yas-tryout-snippet)
     ("l" yas-describe-tables)
     ("g" yas/global-mode :color red)
     ("m" yas/minor-mode :color red)
     ("a" yas-reload-all))

#+END_SRC

#+RESULTS:
: hydra-yasnippet/body




* HYDRAS
#+begin_src emacs-lisp :tangle yes

   (defhydra hydra-org (:color amaranth :columns 3)
     "Org Mode Movements"
     ("n" outline-next-visible-heading "next heading")
     ("p" outline-previous-visible-heading "prev heading")
     ("N" org-forward-heading-same-level "next heading at same level")
     ("P" org-backward-heading-same-level "prev heading at same level")
     ("u" outline-up-heading "up heading")
     ("k" kill-region "kill region")
     ("y" yank "paste")
     ("l" helm-show-kill-ring "list" :color blue)  
     ("r" org-refile "refile")
     ("t" org-todo "todo")
     ("g" org-set-tags-command "tags")
     ("s" show-subtree "expand subtree")
     ("h" hide-subtree "collapse subtree")
     ("a" org-archive-subtree "archive")
     ("G" org-goto "goto" :exit t)
     ("q" nil "quit" :color blue)
     )




   (defhydra goto (:color blue :hint nil)
     "
         Goto:
         ^Char^              ^Word^                ^org^                    ^search^
         ^^^^^^^^---------------------------------------------------------------------------
         _c_: 2 chars        _w_: word by char     _h_: headline in buffer  _o_: helm-occur
         _C_: char           _W_: some word        _a_: heading in agenda   _p_: helm-swoop
         _L_: char in line   _s_: subword by char  _q_: swoop org buffers   _f_: search forward
         ^  ^                _S_: some subword     ^ ^                      _b_: search backward
         -----------------------------------------------------------------------------------
         _B_: helm-buffers       _l_: avy-goto-line
         _m_: helm-mini          _i_: ace-window
         _R_: helm-recentf

         _n_: Navigate           _._: mark position _/_: jump to mark
         "
     ("c" avy-goto-char-2)
     ("C" avy-goto-char)
     ("L" avy-goto-char-in-line)
     ("w" avy-goto-word-1)
     ;; jump to beginning of some word
     ("W" avy-goto-word-0)
     ;; jump to subword starting with a char
     ("s" avy-goto-subword-1)
     ;; jump to some subword
     ("S" avy-goto-subword-0)
     ("l" avy-goto-line)
     ("i" ace-window)
     ("h" helm-org-headlines)
     ("a" helm-org-agenda-files-headings)
     ("q" helm-multi-swoop-org)
     ("o" helm-occur)
     ("p" helm-swoop)
                                           ;        ("p" swiper-helm)
     ("f" isearch-forward)
     ("b" isearch-backward)
     ("." org-mark-ring-push :color red)
     ("/" org-mark-ring-goto :color blue)
     ("B" helm-buffers-list)
     ("m" helm-mini)
     ("R" helm-recentf)
     ("n" hydra-navigate/body))

   (global-set-key (kbd "s-g") 'goto/body)


#+end_src

#+RESULTS:
: goto/body

* DIRED
:PROPERTIES:
:ID:       oi0gh0v0dti0
:UPDATE_DATE: 2020.0822 opens ok
:END:
#+BEGIN_SRC emacs-lisp :tangle yes
   (add-hook 'dired-load-hook
             (function (lambda () (load "dired-x"))))

   (add-hook 'dired-mode-hook
             (lambda ()
               ;; Set dired-x buffer-local variables here.  For example:
               (dired-omit-mode 1)
               ))
   (setq dired-omit-verbose nil)
   ;; toggle `dired-omit-mode' with C-x M-o
   (add-hook 'dired-mode-hook #'dired-omit-mode)
   (setq dired-omit-files
         (concat dired-omit-files "\\|^.DS_STORE$\\|^.projectile$\\|^.org~$"))
                                           ;added 2020.0822. opens ok. 
   (diredp-toggle-find-file-reuse-dir 1)
#+END_SRC

#+RESULTS:
: Reusing Dired buffers is now ON


: ^\.?#\|^\.$\|^\.\.$\|^.DS_STORE$\|^.projectile$\|^.org~$\|^.DS_STORE$\|^.projectile$\|^.org~$



(eval-after-load "dired-aux"
'(add-to-list 'dired-compress-file-suffixes 
'("\\.zip\\'" ".zip" "unzip")))


(defhydra hydra-dired (:hint nil :color pink)
"
_+_ mkdir          _v_iew           _m_ark             _(_ details        _i_nsert-subdir    wdired
_C_opy             _O_ view other   _U_nmark all       _)_ omit-mode      _$_ hide-subdir    C-x C-q : edit
_D_elete           _o_pen other     _u_nmark           _l_ redisplay      _w_ kill-subdir    C-c C-c : commit
_R_ename           _M_ chmod        _t_oggle           _g_ revert buf     _e_ ediff          C-c ESC : abort
_Y_ rel symlink    _G_ chgrp        _E_xtension mark   _s_ort             _=_ pdiff
_S_ymlink          ^ ^              _F_ind marked      _._ toggle hydra   \\ flyspell
_r_sync            ^ ^              ^ ^                ^ ^                _?_ summary
_z_ compress-file  _A_ find regexp
_Z_ compress       _Q_ repl regexp

T - tag prefix
"
("\\" dired-do-ispell)
("(" dired-hide-details-mode)
(")" dired-omit-mode)
("+" dired-create-directory)
("=" diredp-ediff)         ;; smart diff
("?" dired-summary)
("$" diredp-hide-subdir-nomove)
("A" dired-do-find-regexp)
("C" dired-do-copy)        ;; Copy all marked files
("D" dired-do-delete)
("E" dired-mark-extension)
("e" dired-ediff-files)
("F" dired-do-find-marked-files)
("G" dired-do-chgrp)
("g" revert-buffer)        ;; read all directories again (refresh)
("i" dired-maybe-insert-subdir)
("l" dired-do-redisplay)   ;; relist the marked or singel directory
("M" dired-do-chmod)
("m" dired-mark)
("O" dired-display-file)
("o" dired-find-file-other-window)
("Q" dired-do-find-regexp-and-replace)
("R" dired-do-rename)
("r" dired-do-rsynch)
("S" dired-do-symlink)
("s" dired-sort-toggle-or-edit)
("t" dired-toggle-marks)
("U" dired-unmark-all-marks)
("u" dired-unmark)
("v" dired-view-file)      ;; q to exit, s to search, = gets line #
("w" dired-kill-subdir)
("Y" dired-do-relsymlink)
("z" diredp-compress-this-file)
("Z" dired-do-compress)
("q" nil)
("." nil :color blue))

; (define-key dired-mode-map "." 'hydra-dired/body)



#+RESULTS:
: hydra-dired/body

* NEW snippets
#+begin_src emacs-lisp :tangle yes



                                           ;(use-package org-super-links
                                           ; :quelpa (org-super-links :repo "toshism/org-super-links" :fetcher github :commit "0.2"))



   (use-package org-drill)

   (setq org-src-fontify-natively t)
   (setq display-time-mode t)
   (setq fill-flowed-encode-column 1000)
   (setq org-contacts-files (quote ("~/Dropbox/Zettelkasten/contacts.org")))
   (setq org-timer-display (quote both))


   (global-activity-watch-mode)

   (centered-cursor-mode nil)
   (unkillable-scratch 1)

   (require 'org-download)

   ;; Drag-and-drop to `dired`
   (add-hook 'dired-mode-hook 'org-download-enable)

   (use-package org-treeusage
     :bind ("C-c <f5>" . org-treeusage-mode)
     :custom
     ;; Below two settings recreate the above image
     ((org-treescope-overlay-header nil)
      (org-treeusage-overlay-usecolorbands nil)))


   (defun org-count-subheadings ()
     "Count the number of direct and recursive subheadings below the current heading."
     (interactive)
     (let ((descendants 0)
           (children 0)
           (heading-level (1+ (org-outline-level)))
           (end (save-excursion
                  (ignore-errors
                    (outline-end-of-subtree)
                    (point)))))
       (when end
         (save-excursion 
           (while (and (outline-next-heading)
                       (< (point) end))
             (progn
               (setf descendants (1+ descendants))
               (when (= heading-level (org-outline-level))
                 (setf children (1+ children)))))))
       (message "%d direct children, %d descendants" children descendants)))
                                           ; (global-mu4e-conversation-mode)
#+end_src

#+RESULTS:
: org-count-subheadings

* emacs mechanics
#+begin_src emacs-lisp :tangle yes
   (setq visible-bell nil)
   (add-to-list 'default-frame-alist '(fullscreen . maximized))
   (setq inhibit-startup-screen t)

   (tool-bar-mode -1)
   (menu-bar-mode -1)
   (scroll-bar-mode -1)

   (setq initial-major-mode 'org-mode)

   (delete-selection-mode) ;allows to delete selected text by typing

   (fset 'yes-or-no-p 'y-or-n-p)

   (setq confirm-kill-emacs (quote y-or-n-p))


   (set-fringe-mode '(100 . 100))
   (setq ring-bell-function (quote ignore))


#+end_src

#+RESULTS:
: ignore

* font/coding/wrapping

      (set-fontset-font "fontset-default" '(#x1100 . #xffdc)
                        '("NanumBarunpen" . "unicode-bmp" )

                        )
      (set-fontset-font "fontset-default" '(#xe0bc . #xf66e) 
                        '("Nanumbarunpen" . "unicode-bmp")


) 
#+BEGIN_SRC emacs-lisp :tangle yes

   (defvar symbola-font (if (eq system-type 'gnu/linux)
                            (font-spec :name "Symbola" :size 15)
                          "Symbola-14"))


    (set-fontset-font "fontset-default" '(#x2000 . #x206F)
                        '("Symbola" . "unicode-bmp" ))
   (set-fontset-font "fontset-default" '(#x2200 . #x22FF)
                        '("Symbola" . "unicode-bmp" ))

 (set-fontset-font "fontset-default" '(#x25A0 . #x25FF)
                        '("Symbola" . "unicode-bmp" ))
  
     (set-fontset-font "fontset-default" '(#x2600 . #x26FF)
                        '("Symbola" . "unicode-bmp" ))
    (set-fontset-font "fontset-default" '(#x2700 . #x27BF)
                        '("Symbola" . "unicode-bmp" ))
  
                                                  ;  (set-fontset-font "fontset-default" '(#x2091 . #x21ff)     
                                              ;                   (font-spec :size 30)) 

;https://www.reddit.com/r/emacs/comments/8tz1r0/how_to_set_font_according_to_languages_that_i/e1bjce6?utm_source=share&utm_medium=web2x&context=3
(when (fboundp #'set-fontset-font)
  (set-fontset-font t 'korean-ksc5601	
                    ;; Noto Sans CJK: https://www.google.com/get/noto/help/cjk/
                    (font-spec :family "Nanum Gothic Coding")))
(dolist (item '(("Nanum Gothic Coding" . 1.0)))
  (add-to-list 'face-font-rescale-alist item))

      (setq use-default-font-for-symbols nil)

      (use-package unicode-fonts
        :ensure t
        :defer t
        :init (unicode-fonts-setup))


      (setq global-visual-fill-column-mode t)
      (setq global-visual-line-mode t)


      (eval-after-load "flyspell"
        '(define-key flyspell-mode-map (kbd "C-.") nil))




#+END_SRC

#+RESULTS:


* calendar & calfw
#+BEGIN_SRC emacs-lisp :tangle yes

   (use-package calfw)
   (use-package calfw-org)
                                           ;   (use-package calfw-gcal)
   (use-package calfw-cal)
   (setq package-check-signature nil)
                                           ;  (setq org-gcal-down-days '30)
                                           ;for http400 error, open scratch and evaluate (org-gcal-request-token) using C-x C-e


   (defun my-open-calendar ()
     (interactive)
     (cfw:open-calendar-buffer
      :contents-sources
      (list
       (cfw:org-create-source "pale green")  ; orgmode source
       (cfw:cal-create-source "light goldenrod") ; diary source
       ))) 
   (add-hook 'cfw:calendar-mode-hook (lambda () (visual-fill-column-mode 0)))
                                           ;   (setq calendar-daylight-savings-starts '(3 11 year))
                                           ;  (setq calendar-daylight-savings-ends: '(11 4 year))
   (setq calendar-week-start-day 1)

   (setq diary-file "~/Dropbox/Zettelkasten/diary")



#+END_SRC

#+RESULTS:
: ~/Dropbox/Zettelkasten/diary

  




* epub
#+begin_src emacs-lisp  :tangle yes

   (setq nov-post-html-render-hook  (lambda () (visual-line-mode 1)))
   (add-hook 'ereader-mode-hook (lambda () (visual-line-mode 1)))

#+end_src
* mu4e
[[file:~/.mbsyncrc::IMAPAccount gmail]]

#+BEGIN_SRC emacs-lisp :tangle yes

                                           ; (use-package mu4e) 
                                           ; (use-package mu4e-contrib)
   (require 'mu4e)
   (require 'org-mu4e)
   ;; don't save message to Sent Messages, Gmail/IMAP takes care of this

   (setq mu4e-sent-messages-behavior 'delete)
   (setq message-kill-buffer-on-exit t)
   (setq mu4e-change-filenames-when-moving t)
   (setq mu4e-compose-format-flowed t)

   (setq mu4e-hide-index-messages t)
   ;; Call EWW to display HTML messages
                                           ;(defun jcs-view-in-eww (msg)
                                           ; (eww-browse-url (concat "file://" (mu4e~write-body-to-html msg))))

   ;; Arrange to view messages in either the default browser or EWW
   (add-to-list 'mu4e-view-actions '("ViewInBrowser" . mu4e-action-view-in-browser) t)
                                           ; (add-to-list 'mu4e-view-actions '("Eww view" . jcs-view-in-eww) t)

   ;; From Ben Maughan: Get some Org functionality in compose buffer
   (add-hook 'message-mode-hook 'turn-on-orgtbl)
                                           ; (add-hook 'message-mode-hook 'turn-on-orgstruct++)

   (add-hook 'mu4e-view-mode-hook 'visual-line-mode)
   (add-hook 'mu4e-view-mode-hook 'visual-fill-column-mode)

   (defun no-auto-fill ()
     "Turn off auto-fill-mode."
     (auto-fill-mode -1))


   (defun vcfm-off ()
                                           ;turn off visual fill column mode
     (visual-fill-column-mode nil))

   (add-hook 'mu4e-compose-mode-hook #'no-auto-fill)
   (add-hook 'mu4e-headers-mode-hook (lambda ()(visual-line-mode -1)))

   (setq mu4e-compose-dont-reply-to-self t)
   (setq mu4e-confirm-quit nil)
   (setq mu4e-display-update-status-in-modeline nil)
   (setq mu4e-index-lazy-check t)


   (setq mu4e-bookmarks
         (quote
          ((:name "Inbox" :query "maildir:/INBOX" :key 117)
           (:name "Today's messages" :query "date:today..now" :key 116)
           (:name "Last 7 days" :query "date:7d..now" :show-unread t :key 119)
           (:name "Messages with images" :query "mime:image/*" :key 112))))
#+END_SRC
  
#+RESULTS:
| :name | Inbox                | :query | maildir:/INBOX  | :key         | 117 |      |     |
| :name | Today's messages     | :query | date:today..now | :key         | 116 |      |     |
| :name | Last 7 days          | :query | date:7d..now    | :show-unread |   t | :key | 119 |
| :name | Messages with images | :query | mime:image/*    | :key         | 112 |      |     |
  
** message view

#+BEGIN_SRC emacs-lisp :tangle yes
                                           ;  (setq mu4e-attachment-dir "/home/betsy/Dropbox/Spring 2019/")




   (setq shr-color-visible-luminance-min 50) 
   (setq shr-color-visible-distance-min 5)
                                           ;(setq mu4e-view-html-plaintext-ratio-heuristic 'most-positive-fixnum)
   (setq message-yank-prefix ""
         message-yank-empty-prefix ""
         message-yank-cited-prefix "")

   (setq w3m-default-desplay-inline-images t)
   (defun mu4e-action-view-in-w3m ()
     "View the body of the message in emacs w3m."
     (interactive)
     (w3m-browse-url (concat "file://"
                             (mu4e~write-body-to-html (mu4e-message-at-point t)))))


   ;; customize the reply-quote-string
   (setq message-citation-line-format "\n\nOn %a %d %b %Y at %R, %f wrote:\n")
   ;; choose to use the formatted string
   (setq message-citation-line-function 'message-insert-formatted-citation-line)


   (setq mu4e-view-scroll-to-next nil)

   (add-hook 'message-mode-hook 'visual-fill-column-mode)



#+END_SRC

#+RESULTS:
: United States

** headers view

 


#+BEGIN_SRC emacs-lisp :tangle yes
   (setq mu4e-headers-include-related nil)
   (setq mu4e-headers-fields
         '( (:human-date    .  15)    ;; alternatively, use :human-date
            (:flags         .   5)
            (:from          .  20)
            (:thread-subject       . 70 )
                                           ;             (:thread-subject       . 120 )
            )) 
   (setq org-mu4e-link-query-in-headers-mode nil)
   (setq mu4e-update-interval 300)
   (setq mu4e-use-fancy-chars nil)
   (setq mu4e-index-update-in-background t)
   (setq mu4e-view-prefer-html t)
   (setq mu4e-headers-skip-duplicates t)
   (setq mu4e-headers-auto-update t)
   (setq mu4e-view-show-addresses t)
   (setq mu4e-view-show-images t)
   (setq mu4e-headers-date-format "%x")
   (setq mu4e-headers-time-format "%H:%M")
#+END_SRC

#+RESULTS:
: %H:%M

** settings

#+BEGIN_SRC emacs-lisp :tangle yes

   ;; allow for updating mail using 'U' in the main view:
   (setq mu4e-get-mail-command "true")
                                           ;(setq mail-user-agent 'mu4e-user-agent)
   (use-package org-msg)
   (setq org-msg-options "html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil \\n:t"
         org-msg-startup "hidestars indent inlineimages"
                                           ;	org-msg-greeting-fmt "\nHi *%s*,\n\n"
         org-msg-greeting-name-limit 3
         org-msg-text-plain-alternative t
         org-msg-signature "

    In solidarity,

    ,#+begin_signature
    -- *Betsy (she/they)* \\\\
    ,#+end_signature")
   (org-msg-mode)

#+END_SRC 

#+RESULTS:
: t

** folders

#+BEGIN_SRC emacs-lisp :tangle yes

   (setq mu4e-maildir-shortcuts
         '( ("/INBOX"  . ?i)
            ("/Sent"   . ?s)
            ("/Trash"  . ?t)
            ("/All"    . ?a)))

   (setq mu4e-drafts-folder "/Drafts")
   (setq mu4e-sent-folder   "/Sent")
   (setq mu4e-trash-folder  "/Trash")
   (setq mu4e-refile-folder "/All")
   (setq mu4e-maildir "~/Maildir")
   (setq mu4e-attachment-dir "~/Dropbox/2020")
#+END_SRC 

#+RESULTS:
: ~/Dropbox/2020

  









* usability (editing)


#+BEGIN_SRC emacs-lisp :tangle yes

   (use-package multiple-cursors
     :ensure t
     :bind (("C->" . mc/mark-all-like-this)
	 ("C-<" . mc/mark-next-like-this)
("C-c 1" . mc/insert-numbers)
("C-S-'" . mc/edit-lines)
("C-M-." . mc/mark-pop)
            ("C-S-<mouse-1>" . mc/add-cursor-on-click)))

      (use-package smartparens
        :ensure t
        :defer t
        :init
        (show-smartparens-global-mode 1))
      (smartparens-global-mode 1)
      (setq show-paren-style 'expression)

      (sp-local-pair 'org-mode "/" "/" :actions '(wrap))
      (sp-local-pair 'org-mode "_" "_" :actions '(wrap))
      (sp-local-pair 'org-mode "*" "*" :actions '(wrap))
      (sp-local-pair 'org-mode "+" "+" :actions '(wrap))
      (sp-local-pair 'org-mode "~" "~" :actions '(wrap))
      (sp-local-pair 'org-mode "=" "=" :actions '(wrap))
      (sp-local-pair 'org-mode "-" "-" :actions '(wrap))
      (sp-pair "'" nil :actions :rem)


      (setq blink-matching-paren-dont-ignore-comments nil)

                                              ;autocompletion
      (use-package company
        :ensure t
        :init (global-company-mode)
        :config (company-mode 1))     

                                              ;spellcheck
      (use-package flyspell-correct-helm)

#+END_SRC

#+RESULTS:

(setq electric-pair-pairs
(quote
((34 . 34)
(8216 . 8217)
(8220 . 8221)
(42 . 42)
(95 . 95)
(47 . 47)
(126 . 126)
(43 . 43))))





* anki
#+begin_src emacs-lisp :tangle yes
   (setq select-enable-clipboard t
         x-select-enable-primary nil)
   (use-package anki-editor
     :after org
     :hook (org-capture-after-finalize . anki-editor-reset-cloze-number) ; Reset cloze-number after each capture.
     :config
     (setq anki-editor-create-decks t)
     (defun anki-editor-cloze-region-auto-incr (&optional arg)
       "Cloze region without hint and increase card number."
       (interactive)
       (anki-editor-cloze-region my-anki-editor-cloze-number "")
       (setq my-anki-editor-cloze-number (1+ my-anki-editor-cloze-number))
       (forward-sexp))
     (defun anki-editor-cloze-region-dont-incr (&optional arg)
       "Cloze region without hint using the previous card number."
       (interactive)
       (anki-editor-cloze-region (1- my-anki-editor-cloze-number) "")
       (forward-sexp))
     (defun anki-editor-reset-cloze-number (&optional arg)
       "Reset cloze number to ARG or 1"
       (interactive)
       (setq my-anki-editor-cloze-number (or arg 1)))
     (defun anki-editor-push-tree ()
       "Push all notes under a tree."
       (interactive)
       (anki-editor-push-notes '(4))
       (anki-editor-reset-cloze-number))
     ;; Initialize
     (anki-editor-reset-cloze-number)
     )






#+end_src

#+RESULTS:
| anki-editor-reset-cloze-number | yankpad--remove-id-from-yankpad-capture |

* chronos
#+begin_src emacs-lisp :tangle yes
   (setq chronos-notification-time 120)
   (setq chronos-notification-wav "~/Dropbox/emacs/.emacs.d/sms-alert-1-daniel_simon.wav")
   (use-package org-alert)

   (defun chronos-switch-buffer-notify (c)
     "Switch to the chronos buffer when timer expires"
     (switch-to-buffer "chronos"))

   (use-package org-pomodoro) (setq org-pomodoro-finished-sound "~/Dropbox/emacs/.emacs.d/sms-alert-1-daniel_simon.wav")
                                           ; (setq org-pomodoro-finished-sound-args "~/Dropbox/emacs/.emacs.d/sms-alert-1-daniel_simon.wav")
   (setq org-pomodoro-short-break-sound "~/Dropbox/emacs/.emacs.d/sms-alert-1-daniel_simon.wav" )
   (setq org-pomodoro-long-break-sound "~/Dropbox/emacs/.emacs.d/sms-alert-1-daniel_simon.wav" )
   (setq org-pomodoro-ticking-sound-p t)
   (setq org-pomodoro-manual-break nil)
   (setq org-pomodoro-clock-break nil)

   (setq helm-chronos-standard-timers
         '(       "=13:00/END fast + =20:00/BEGIN fast"
                  "=18:00/begin ref shift + -5/ref in 5 min + =22:00/end shift"
                  "25/END pomodoro + 5/END break" 
                  "50/END pomodoro + 5/get back to work" 

                  "25/END pomodoro 1 + 5/END break 1 + 25/END pomodoro 2 + 5/END break 2 + 25/END pomodoro 3 + 5/END break 3 + 25/END pomodoro 4 + 5/END break 4"))

#+end_src

#+RESULTS:
| =13:00/END fast + =20:00/BEGIN fast | =18:00/begin ref shift + -5/ref in 5 min + =22:00/end shift | 25/END pomodoro + 5/END break | 50/END pomodoro + 5/get back to work | 25/END pomodoro 1 + 5/END break 1 + 25/END pomodoro 2 + 5/END break 2 + 25/END pomodoro 3 + 5/END break 3 + 25/END pomodoro 4 + 5/END break 4 |


(use-package pomidor)
(setq pomidor-save-session-file "~/Dropbox/emacs/.emacs.d/pomidor-session.json")
(setq pomidor-sound-break-over "~/Dropbox/emacs/.emacs.d/sms-alert-1-daniel_simon.wav")
(setq pomidor-sound-overwork "~/Dropbox/emacs/.emacs.d/overwork.wav")
(setq pomidor-sound-tick "~/Dropbox/emacs/.emacs.d/tick.wav")
(setq pomidor-sound-tack "~/Dropbox/emacs/.emacs.d/tack.wav")

* openwith   

#+BEGIN_SRC emacs-lisp :tangle yes
   (use-package openwith
     :defer t
     :config (progn
               (when (require 'openwith nil 'noerror)
                 (setq openwith-associations
                       (list
                                           ;                   (list (openwith-make-extension-regexp
                                           ;                           '("mpg" "mpeg" "mp3" "mp4"
                                           ;                           "avi" "wmv" "wav" "mov" "flv"
                                           ;                          "ogm" "ogg" "mkv"))
                                           ;                      "audacious"
                                           ;                     '(file))
                                           ;                    (list (openwith-make-extension-regexp
                                           ;                          '("xbm" "pbm" "pgm" "ppm" "pnm"
                                           ;                           "png" "bmp" "tif" "jpeg" "jpg"))
                                           ;                       "gpicview"
                                           ;                      '(file))
                                           ;                       (list (openwith-make-extension-regexp
                                           ;                             '("pdf"))
                                           ;                           "zathura"
                                           ;                          '(file))
                        (list (openwith-make-extension-regexp
                               '("doc" "docx" "ppt" "xls" "xlsx" "pptx"))
                              "LibreOffice"
                              '(file))

                        ))
                 (openwith-mode 1)))
     :ensure t)
   (add-to-list  'mm-inhibit-file-name-handlers 'openwith-file-handler)

   (use-package crux
     :ensure t
     :bind (("C-c o" . crux-open-with)
            ("M-o" . crux-smart-open-line)
            ("C-c n" . crux-cleanup-buffer-or-region)
            ("C-c f" . crux-recentf-find-file)
            ("C-M-z" . crux-indent-defun)
            ("C-c u" . crux-view-url)
            ("C-c e" . crux-eval-and-replace)
            ("C-c w" . crux-swap-windows)
            ("C-c D" . crux-delete-file-and-buffer)
            ("C-c r" . crux-rename-buffer-and-file)
            ("C-c t" . crux-visit-term-buffer)
            ("C-c k" . crux-kill-other-buffers)
            ("C-c TAB" . crux-indent-rigidly-and-copy-to-clipboard)
            ("C-c I" . crux-find-user-init-file)
            ("C-c S" . crux-find-shell-init-file)
            ("s-r" . crux-recentf-find-file)
            ("s-j" . crux-top-join-line)
            ("C-^" . crux-top-join-line)
            ("s-k" . crux-kill-whole-line)
            ("C-<backspace>" . crux-kill-line-backwards)
            ("s-o" . crux-smart-open-line-above)
            ([remap move-beginning-of-line] . crux-move-beginning-of-line)
            ([(shift return)] . crux-smart-open-line)
            ([(control shift return)] . crux-smart-open-line-above)
            ([remap kill-whole-line] . crux-kill-whole-line)
            ("C-c s" . crux-ispell-word-then-abbrev)))

#+END_SRC

#+RESULTS:
: crux-ispell-word-then-abbrev

(require 'run-assoc)
(setq associated-program-alist
'(("libreoffice" "\\.docx$")
("libreoffice" "\\.xsls$")
;		("evince" "\\.pdf$")
;		("mplayer" "\\.mp3$")
;		("evince" "\\.ps$")
((lambda (file)
(browse-url (concat "file:///" (expand-file-name file)))) "\\.html?$")))








* org-roam
:PROPERTIES:
:UPDATE_DATE: 2020.0822
:END:
https://www.reddit.com/r/emacs/comments/ioq1et/incorrect_time_output/
(format-time-string "%b%d%Y-%I%M" (current-time) t)

Everywhere else in my Emacs has correct time. For instance, the following outputs the correct time: (current-time).

What is going on?

EDIT: Solved. Passing t causes UTC to be used. Passing nil leads to Emacs time being used and nil to system clock being used.

#+begin_src emacs-lisp :tangle yes

   (use-package org-roam)

   (setq org-roam-capture-templates '(("d" "default" plain #'org-roam--capture-get-point "* ${title}\n:PROPERTIES:\n:VISIBILITY: all\n:END:\n%?" :file-name "%(format-time-string \"%Y%m%d-%H%M_${slug}\" (current-time) )"
 "#+title: ${title}" :unnarrowed t :kill-buffer t)))


   (setq org-roam-directory "~/Dropbox/Zettelkasten/Zettels/")
#+end_src

#+RESULTS:
: ~/Dropbox/Zettelkasten/Zettels/

   (setq org-roam-db-location "~/Dropbox/Zettelkasten/Zettels/")
 :ensure t
     :hook
     (org-load . org-roam-mode)
     :custom
 
     :bind (:map org-roam-mode-map
                 (("C-c n l" . org-roam)
                  ("C-c n f" . org-roam-find-file)
                  ("C-c n g" . org-roam-graph-show))
                 :map org-mode-map
                 (("C-c n i" . org-roam-insert))
                 (("C-c n I" . org-roam-insert-immediate))))





* diminish
#+BEGIN_SRC emacs-lisp :tangle yes
     (require 'diminish)
   (diminish 'activity-watch-mode "aw")
   (diminish 'company-mode)
   (diminish 'helm-mode)
   (diminish 'visual-line-mode)
   (diminish 'org-edna-mode "ed")
   (diminish 'org-indent-mode)
   (diminish 'projectile-mode "prj")
   (diminish 'smartparens-mode)
(diminish 'org-roam-mode "rm")
#+END_SRC

#+RESULTS:
| rm |

* keybindings


#+begin_src emacs-lisp :tangle yes
      (global-unset-key (kbd "<up>"))
      (global-unset-key (kbd "<down>"))
      (global-unset-key (kbd "<right>"))
      (global-unset-key (kbd "<left>"))
      (global-unset-key (kbd "M-o"))
      (global-set-key (kbd "M-o") 'other-window)
      (define-key yas-minor-mode-map [(tab)] nil)
      (define-key yas-minor-mode-map (kbd "TAB") nil)
      (global-unset-key (kbd "C-z"))
      (global-set-key (kbd "M-n") 'toggle-input-method)
      (global-set-key (kbd "C-<f1>") 'set-input-method)

                                              ;   (global-unset-key (kbd "M-c"))
                                              (global-unset-key (kbd "C-v "))

                                              ; (define-key org-mode-map (kbd "C-a") 'org-beginning-of-line)
      (define-key org-mode-map (kbd "C-a") 'org-beginning-of-line)
      (define-key org-mode-map (kbd "C-e") 'org-end-of-line)
      (global-unset-key (kbd "S-SPC"))
      (global-set-key (kbd "C-c C-x C-o") 'org-clock-out)
      (global-set-key (kbd "C-c <f2>") 'org-clock-out)

      (global-set-key (kbd "<f1>") 'org-capture)
      (define-key dired-mode-map (kbd "<f1>") 'org-capture)
      (define-key dired-mode-map (kbd "M-z") 'ace-jump-mode)
   (global-set-key (kbd "C-c C-x C-j") 'org-clock-goto)
      (bind-keys 
                                              ;("C-+"   . text-scale-increase)
         ("C-c p" . org-set-property)                                     ;   a      ("C--"   . text-scale-decrease)
       ("C-c l" . org-store-link)
   ("M-<f3>" . sl-store-link)
     ("C-c <f3>" . sl-insert-link)

       ("M-z" . ace-jump-mode)                                          ;                 ("C-c k" . toggle-korean-input-method)
       ("C-."   . org-todo)
                                              ;              ("C-x /" . shrink-window-horizontally)
       ("C-x ." . org-archive-subtree-default)
                                              ;       ("C-c n" . org-schedule)

       ("M-="   . count-words)
       ("M-x"   . helm-M-x)

       ("C-c b" . list-bookmarks)
                                              ;    ("C-a" . org-beginning-of-line)
            ("M-<f2>" . org-mru-clock-in)                                  ;          ([menu] . toggle-input-method)
             ("M-<f4>" . org-time-stamp-inactive)
	            ("M-<f5>" . org-time-stamp)      
                                           ;   ("C-e" . org-end-of-line)
       ("C-k" . org-kill-line)
                                              ;              ("C-<kp-6>" . xah-select-block)
       ("C-x C-b" . bufler-list)                              ;   ("C-x j" . helm-org-in-buffer-headings)
       ("C-x b" . bufler-switch-buffer)
       ("C-c i" . insert-timestamp)
                                              ;  ("C-c a" . helm-org-agenda-files-headings)
       ("C-c C-x C-r" . org-clock-report)
   ("C-c <f1>" . org-roam-capture)
       ("M-[" . org-metaleft)
                 ("M-]" . org-metaright)
                 ("M-{" . org-shiftmetaleft)
                 ("M-}" . org-shiftmetaright)
       ([f1] . org-capture)
       ([f2] . org-clock-in)
   ;    ([f3] . frog-jump-buffer)           
     ([f3] . helm-buffers-list)           
       ([f4] . org-refile)
       ([f5] . helm-projectile)
       ([f6] . helm-bibtex-with-local-bibliography)
       ([f7] . org-agenda)
       ([f8] . deft)
       ([f9] . helm-swoop-without-pre-input)
       ([f10] . org-narrow-to-subtree)
       ([f11] . org-id-goto)
       ([f12] . bury-buffer)

       )



                                              ;   (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
                                              ;  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)

      (define-key key-translation-map (kbd "C-c <up>") (kbd "🡑"))
      (define-key key-translation-map (kbd "C-c <down>") (kbd "🡓"))
      (define-key key-translation-map (kbd "C-c =") (kbd "≠"))
      (define-key key-translation-map (kbd "C-c <right>") (kbd "→"))
      (define-key key-translation-map (kbd "C-c m") (kbd "—"))
      (define-key key-translation-map (kbd "C-_") (kbd "–"))

      (define-key key-translation-map (kbd "C-c d") (kbd "Δ"))
      (define-key key-translation-map (kbd "C-c C-<right>")  (kbd "🡆"))
      (define-key key-translation-map (kbd "C-c z")  (kbd "∴"))

#+end_src

#+RESULTS:
: [8756]


* theme


#+BEGIN_SRC emacs-lisp :tangle yes

(use-package doom-themes
:ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-one t)

  ;; Enable flashing mode-line on errors
;  (doom-themes-visual-bell-config)
  
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)
  
  ;; Corrects (and improves) org-mode's native fontification.
 (doom-themes-org-config)
)

(find-file "~/Dropbox/emacs/config.org")
(find-file "~/Dropbox/emacs/.emacs")

#+end_src

#+RESULTS:
: #<buffer .emacs>



#+RESULTS:
: t

